# Getting started with pandas

In [2]:
from pandas import Series, DataFrame
import pandas as pd

In [3]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [6]:
%pwd

u'/Users/hanzg/src/Personal/DataScience/pydata-book-master'

## Introduction to pandas data structures

### Series

In [8]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [ ]:
obj2.index

In [15]:
obj2['a']

-5

In [ ]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

In [ ]:
obj2[obj2 > 0]

In [ ]:
obj2 * 2

In [16]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
'b' in obj2

True

In [18]:
'e' in obj2

False

In [22]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
states = [ 'Ohio', 'California','Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

Ohio          35000.0
California        NaN
Oregon        16000.0
Texas         71000.0
dtype: float64

In [ ]:
pd.isnull(obj4)

In [ ]:
pd.notnull(obj4)

In [ ]:
obj4.isnull()

In [ ]:
obj3

In [ ]:
obj4

In [24]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
Ohio          35000.0
California        NaN
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [26]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [27]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [28]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [29]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [30]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [31]:
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [34]:
frame2['state'].name

'state'

In [33]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [35]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [42]:
frame2['debt'] = np.arange(10.)
frame2

ValueError: Length of values does not match length of index

In [ ]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

In [ ]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

In [ ]:
del frame2['eastern']
frame2.columns

In [49]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [50]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [ ]:
frame3.T

In [ ]:
DataFrame(pop, index=[2001, 2002, 2003])

In [ ]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

In [ ]:
frame3.values

In [ ]:
frame2.values

### Index objects

In [43]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [44]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [51]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [46]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [52]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [53]:
'Ohio' in frame3.columns

True

In [54]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [55]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [56]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [57]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [62]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [60]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [65]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [66]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [67]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [68]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [74]:
frame.ix[['a', 'b','c','d'],states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [7]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [9]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [10]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [13]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [14]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [ ]:
data.drop(['two', 'four'], axis=1)

### Indexing, selection, and filtering

In [44]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [45]:
obj[1]

1.0

In [46]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [47]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [48]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [49]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [19]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [20]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [21]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [23]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [24]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [32]:
data[data['three'] > 5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [27]:
data[data < 5] = 0

In [28]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
data.ix['Colorado', ['two', 'three']]

In [ ]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

In [33]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [35]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [34]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [52]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [53]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [54]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [55]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [57]:
list('bcd')

['b', 'c', 'd']

In [56]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [58]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [59]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### Arithmetic methods with fill values

In [60]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [ ]:
df2

In [ ]:
df1 + df2

In [61]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [62]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

In [63]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [64]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [65]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [66]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [67]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [68]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [69]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [70]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [71]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [74]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function application and mapping

In [ ]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
frame

In [ ]:
np.abs(frame)

In [ ]:
f = lambda x: x.max() - x.min()

In [ ]:
frame.apply(f)

In [ ]:
frame.apply(f, axis=1)

In [ ]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

In [ ]:
format = lambda x: '%.2f' % x
frame.applymap(format)

In [ ]:
frame['e'].map(format)

### Sorting and ranking

In [83]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [76]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [80]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [81]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [85]:
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [ ]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

In [90]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [91]:
frame.sort_index(by='b')

/Library/Python/2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [92]:
frame.sort_index(by=['a', 'b'])

/Library/Python/2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [103]:
obj = Series([7, -5, 7, 4, 4, 2, 2, 2, 2, 2, 0, 4])
obj.rank()

0     11.5
1      1.0
2     11.5
3      9.0
4      9.0
5      5.0
6      5.0
7      5.0
8      5.0
9      5.0
10     2.0
11     9.0
dtype: float64

In [ ]:
obj.rank(method='first')

In [ ]:
obj.rank(ascending=False, method='max')

In [ ]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

In [ ]:
frame.rank(axis=1)

### Axis indexes with duplicate values

In [112]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [108]:
obj.index.is_unique

False

In [109]:
obj['a']

a    0
a    1
dtype: int64

In [110]:
obj['c']

4

In [111]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [42]:
df.ix['b']

          0         1         2
b  0.092908  0.281746  0.769023
b  1.246435  1.007189 -1.296221

## Summarizing and computing descriptive statistics

In [118]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [115]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [116]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [ ]:
df.mean(axis=1, skipna=False)

In [ ]:
df.idxmax()

In [121]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [122]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [ ]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

### Correlation and covariance

In [162]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [163]:
returns = price.pct_change()
returns.head()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897

In [144]:
returns.MSFT.corr(returns.IBM)

0.49652044306548937

In [145]:
returns.MSFT.cov(returns.IBM)

8.7695796034579731e-05

In [ ]:
returns.corr()

In [ ]:
returns.cov()

In [165]:
returns.corrwith(returns.IBM, axis=1)

Date
2010-01-04   NaN
2010-01-05   NaN
2010-01-06   NaN
2010-01-07   NaN
2010-01-08   NaN
2010-01-11   NaN
2010-01-12   NaN
2010-01-13   NaN
2010-01-14   NaN
2010-01-15   NaN
2010-01-19   NaN
2010-01-20   NaN
2010-01-21   NaN
2010-01-22   NaN
2010-01-25   NaN
2010-01-26   NaN
2010-01-27   NaN
2010-01-28   NaN
2010-01-29   NaN
2010-02-01   NaN
2010-02-02   NaN
2010-02-03   NaN
2010-02-04   NaN
2010-02-05   NaN
2010-02-08   NaN
2010-02-09   NaN
2010-02-10   NaN
2010-02-11   NaN
2010-02-12   NaN
2010-02-16   NaN
              ..
2016-10-21   NaN
2016-10-24   NaN
2016-10-25   NaN
2016-10-26   NaN
2016-10-27   NaN
2016-10-28   NaN
2016-10-31   NaN
2016-11-01   NaN
2016-11-02   NaN
2016-11-03   NaN
2016-11-04   NaN
2016-11-07   NaN
2016-11-08   NaN
2016-11-09   NaN
2016-11-10   NaN
2016-11-11   NaN
2016-11-14   NaN
2016-11-15   NaN
2016-11-16   NaN
2016-11-17   NaN
2016-11-18   NaN
2016-11-21   NaN
2016-11-22   NaN
2016-11-23   NaN
2016-11-25   NaN
2016-11-28   NaN
2016-11-29   NaN
2016-11-30   NaN
2016-12-01   NaN
2016-12-02   NaN
dtype: float64

In [164]:
returns.corrwith(volume)

AAPL   -0.072682
GOOG   -0.006909
IBM    -0.202262
MSFT   -0.092110
dtype: float64

### Unique values, value counts, and membership

In [168]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [169]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [170]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [171]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [172]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [173]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [174]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [175]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Handling missing data

In [177]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [178]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [179]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [180]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [181]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [183]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna(axis = 1)
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [184]:
cleaned

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [185]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [186]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [189]:
data.dropna(axis=0, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [190]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0  0.286350       NaN       NaN
1  0.331286       NaN       NaN
2  0.246674       NaN       NaN
3  1.327195       NaN -1.549106
4  0.022185       NaN -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [203]:
df.dropna(thresh=3)

          0         1         2
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [197]:
df.dropna(thresh=3)

          0         1         2
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

### Filling in missing data

In [204]:
df.fillna(0)

          0         1         2
0  0.286350  0.000000  0.000000
1  0.331286  0.000000  0.000000
2  0.246674  0.000000  0.000000
3  1.327195  0.000000 -1.549106
4  0.022185  0.000000 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [207]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0  0.286350  0.500000       NaN
1  0.331286  0.500000       NaN
2  0.246674  0.500000       NaN
3  1.327195  0.500000 -1.549106
4  0.022185  0.500000 -0.660524
5  0.862580 -0.010032  0.050009
6  0.670216  0.852965 -0.955869

In [209]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642  0.000000  1.001543
3 -0.503087  0.000000 -0.921169
4 -0.726213  0.000000  0.000000
5 -1.157719  0.000000  0.000000

In [208]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642       NaN  1.001543
3 -0.503087       NaN -0.921169
4 -0.726213       NaN       NaN
5 -1.157719       NaN       NaN

In [210]:
df.fillna(method='ffill')

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642  0.000000  1.001543
3 -0.503087  0.000000 -0.921169
4 -0.726213  0.000000  0.000000
5 -1.157719  0.000000  0.000000

In [211]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.023493 -2.304234 -0.652469
1 -1.218302 -1.332610  1.074623
2  0.723642  0.000000  1.001543
3 -0.503087  0.000000 -0.921169
4 -0.726213  0.000000  0.000000
5 -1.157719  0.000000  0.000000

In [ ]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

## Hierarchical indexing

In [285]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.029610
   2    0.795253
   3    0.118110
b  1   -0.748532
   2    0.584970
   3    0.152677
c  1   -1.565657
   2   -0.562540
d  2   -0.032664
   3   -0.929006
dtype: float64

In [286]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [214]:
data['b']

1    0.850591
2   -0.131578
3    0.912414
dtype: float64

In [215]:
data['b':'c']

b  1    0.850591
   2   -0.131578
   3    0.912414
c  1    0.188211
   2    2.169461
dtype: float64

In [216]:
data.ix[['b', 'd']]

b  1    0.850591
   2   -0.131578
   3    0.912414
d  2   -0.114928
   3    2.003697
dtype: float64

In [221]:
data.ix[['b','c']]

b  1    0.850591
   2   -0.131578
   3    0.912414
c  1    0.188211
   2    2.169461
dtype: float64

In [222]:
data[:, 2]

a    1.824875
b   -0.131578
c    2.169461
d   -0.114928
dtype: float64

In [283]:
data.unstack()

          1         2         3
a  1.010737  1.824875 -0.997518
b  0.850591 -0.131578  0.912414
c  0.188211  2.169461       NaN
d       NaN -0.114928  2.003697

In [284]:
data.unstack().stack()

a  1    1.010737
   2    1.824875
   3   -0.997518
b  1    0.850591
   2   -0.131578
   3    0.912414
c  1    0.188211
   2    2.169461
d  2   -0.114928
   3    2.003697
dtype: float64

In [224]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [225]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [226]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

In [228]:
MultiIndex

NameError: name 'MultiIndex' is not defined

### Reordering and sorting levels

In [229]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [236]:
frame.swaplevel('key1', 'key2').sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [256]:
frame.sortlevel(1,axis =1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [244]:
frame.sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

### Summary statistics by level

In [258]:
frame.sum(level='state', axis=1)

state      Colorado  Ohio
key1 key2
a    1            2     1
     2            5     7
b    1            8    13
     2           11    19

In [259]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [260]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [ ]:
frame2 = frame.set_index(['c', 'd'])
frame2

In [ ]:
frame.set_index(['c', 'd'], drop=False)

In [ ]:
frame2.reset_index()

## Other pandas topics

### Integer indexing

In [263]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [266]:
ser.iloc[-1]

2.0

In [267]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [268]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [269]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [271]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [273]:
ser3.iloc[2]

2

In [274]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

In [275]:
frame

   0  1
2  0  1
0  2  3
1  4  5

### Panel data

In [276]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [277]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1763 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2016-12-02 00:00:00
Minor_axis axis: Open to Adj Close

In [279]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   27.847252  14.06528  313.062468  25.710416
2010-01-05   27.895396  14.38450  311.683844  25.718722
2010-01-06   27.451683  14.10397  303.826685  25.560888
2010-01-07   27.400936  14.23940  296.753749  25.295062
2010-01-08   27.583106  14.36516  300.709808  25.469510
2010-01-11   27.339779  14.37483  300.255255  25.145534
2010-01-12   27.028789  14.56830  294.945572  24.979392
2010-01-13   27.410045  14.57797  293.252243  25.211991
2010-01-14   27.251297  14.22005  294.630868  25.718722
2010-01-15   26.795872  13.92985  289.710772  25.635652
2010-01-19   27.981276  14.32646  293.516976  25.835022
2010-01-20   27.550575  14.03626  289.915587  25.411360
2010-01-21   27.074331  13.92017  291.199286  24.929550
2010-01-22   25.731480  13.18982  274.730736  24.057305
2010-01-25   26.423726  13.43650  269.730740  24.356361
2010-01-26   26.797173  13.13662  270.939526  24.505889
2010-01-27   27.049609  13.08825  270.779695  24.647109
2010-01-28   25.931866  12.84641  266.878565  24.223448
2010-01-29   24.991091  12.47882  264.705742  23.409354
2010-02-01   25.338514  12.78837  266.244198  23.600417
2010-02-02   25.485551  12.86576  265.295156  23.641951
2010-02-03   25.924059  12.92380  270.140309  23.783172
2010-02-04   24.989789  12.58523  263.127321  23.126913
2010-02-05   25.433503  12.80772  265.380075  23.276441
2010-02-08   25.259140  12.95282  266.468996  23.027228
2010-02-09   25.528492  13.10760  267.952522  23.268134
2010-02-10   25.389262  13.30107  266.958496  23.251519
2010-02-11   25.851191  13.49454  267.932539  23.359512
2010-02-12   26.073698  13.38813  266.294170  23.201677
2010-02-16   26.466665  13.67834  270.380071  23.660703
...                ...       ...         ...        ...
2016-10-21  116.004406       NaN  799.369995  59.259667
2016-10-24  117.049045       NaN  813.109985  60.590676
2016-10-25  117.645979       NaN  807.669983  60.580745
2016-10-26  114.999563       NaN  799.070007  60.223160
2016-10-27  113.895240       NaN  795.349976  59.696714
2016-10-28  113.139120       NaN  795.369995  59.468257
2016-10-31  112.960039       NaN  784.539978  59.517921
2016-11-01  110.920507       NaN  783.609985  59.398727
2016-11-02  111.019995       NaN  768.700012  59.031211
2016-11-03  109.830002       NaN  762.130005  58.812686
2016-11-04  108.839996       NaN  762.020020  58.316041
2016-11-07  110.410004       NaN  782.520020  60.014566
2016-11-08  111.059998       NaN  790.510010  60.064234
2016-11-09  110.879997       NaN  785.309998  59.766244
2016-11-10  107.790001       NaN  762.559998  58.306110
2016-11-11  108.430000       NaN  754.020020  58.623963
2016-11-14  105.709999       NaN  736.080017  57.730000
2016-11-15  107.110001       NaN  758.489990  58.869999
2016-11-16  109.989998       NaN  764.479980  59.650002
2016-11-17  109.949997       NaN  771.229980  60.639999
2016-11-18  110.059998       NaN  760.539978  60.349998
2016-11-21  111.730003       NaN  769.200012  60.860001
2016-11-22  111.800003       NaN  768.270020  61.119999
2016-11-23  111.230003       NaN  760.989990  60.400002
2016-11-25  111.790001       NaN  761.679993  60.529999
2016-11-28  111.570000       NaN  768.239990  60.610001
2016-11-29  111.459999       NaN  770.840027  61.090000
2016-11-30  110.519997       NaN  758.039978  60.259998
2016-12-01  109.489998       NaN  747.919983  59.200001
2016-12-02  109.900002       NaN  750.500000  59.250000

[1763 rows x 4 columns]

In [280]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   72.996726
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   25.093451

In [281]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   72.473644  14.58765  300.100412  26.248896
2012-05-23   74.241986  12.08221  304.426106  25.675584
2012-05-24   73.560156  12.04351  301.528978  25.640302
2012-05-25   73.165884  12.05319  295.470050  25.631482
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   74.464493  12.24666  296.873645  26.072491
2012-05-30   75.362333  12.14992  293.821674  25.878448
2012-05-31   75.174961  11.92743  290.140354  25.746145
2012-06-01   72.996726  11.67592  285.205295  25.093451
2012-06-04   73.426126  11.60821  289.006480  25.181652
2012-06-05   73.236155  11.76298  284.920579  25.146372
2012-06-06   74.359101  11.81619  289.995487  25.887268
2012-06-07   74.392930  11.73396  288.826666  25.781425
2012-06-08   75.511971  11.72429  289.935570  26.151873
2012-06-11   74.321360  11.47278  283.966519  25.490359
2012-06-12   74.970668  11.57919  282.268201  25.834347
2012-06-13   74.450185  11.87423  280.265216  25.693223
2012-06-14   74.368205  11.93711  279.246220  25.878448
2012-06-15   74.706521  11.89841  281.973510  26.478221
2012-06-18   76.222432  12.01449  285.140358  26.319457
2012-06-19   76.434536  11.78233  290.475012  27.077994
2012-06-20   76.217227  11.89841  288.467038  27.280858
2012-06-21   75.167150  11.60821  282.323161  26.584062
2012-06-22   75.743588  11.80168  285.455033  27.077994
2012-06-25   74.269317  11.55500  280.070407  26.345918
2012-06-26   74.433270  11.53565  282.058429  26.478221
2012-06-27   74.754665  11.92743  284.366112  26.610524
2012-06-28   74.045503  11.55984  281.873596  26.381198
2012-06-29   75.990821  12.10155  289.745749  26.980972
2012-07-02   77.099452  11.98064  289.945546  26.954511
...                ...       ...         ...        ...
2016-10-21  116.004406       NaN  799.369995  59.259667
2016-10-24  117.049045       NaN  813.109985  60.590676
2016-10-25  117.645979       NaN  807.669983  60.580745
2016-10-26  114.999563       NaN  799.070007  60.223160
2016-10-27  113.895240       NaN  795.349976  59.696714
2016-10-28  113.139120       NaN  795.369995  59.468257
2016-10-31  112.960039       NaN  784.539978  59.517921
2016-11-01  110.920507       NaN  783.609985  59.398727
2016-11-02  111.019995       NaN  768.700012  59.031211
2016-11-03  109.830002       NaN  762.130005  58.812686
2016-11-04  108.839996       NaN  762.020020  58.316041
2016-11-07  110.410004       NaN  782.520020  60.014566
2016-11-08  111.059998       NaN  790.510010  60.064234
2016-11-09  110.879997       NaN  785.309998  59.766244
2016-11-10  107.790001       NaN  762.559998  58.306110
2016-11-11  108.430000       NaN  754.020020  58.623963
2016-11-14  105.709999       NaN  736.080017  57.730000
2016-11-15  107.110001       NaN  758.489990  58.869999
2016-11-16  109.989998       NaN  764.479980  59.650002
2016-11-17  109.949997       NaN  771.229980  60.639999
2016-11-18  110.059998       NaN  760.539978  60.349998
2016-11-21  111.730003       NaN  769.200012  60.860001
2016-11-22  111.800003       NaN  768.270020  61.119999
2016-11-23  111.230003       NaN  760.989990  60.400002
2016-11-25  111.790001       NaN  761.679993  60.529999
2016-11-28  111.570000       NaN  768.239990  60.610001
2016-11-29  111.459999       NaN  770.840027  61.090000
2016-11-30  110.519997       NaN  758.039978  60.259998
2016-12-01  109.489998       NaN  747.919983  59.200001
2016-12-02  109.900002       NaN  750.500000  59.250000

[1156 rows x 4 columns]

In [282]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900.0
           DELL    12.110000   12.112500   11.800000   12.000000   17015700.0
           GOOG   570.220958  580.491016  570.011006  578.590973    4883500.0
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300.0
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600.0
           DELL    11.950000   12.240000   11.950000   12.160000   15620900.0
           GOOG   575.451008  578.131003  566.470986  570.410999    4697200.0
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400.0
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900.0
           DELL    12.210000   12.280000   12.090000   12.215000   20779900.0
           GOOG   576.480979  581.970971  573.611004  580.570966    4207200.0
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500.0
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700.0
           DELL    12.320000   12.410000   12.120000   12.130000   20074000.0
           GOOG   587.601014  587.891038  577.251006  578.230986    3530100.0
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800.0
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100.0
           DELL    12.130000   12.225000   12.020000   12.120000   18155600.0
...                      ...         ...         ...         ...          ...
2016-11-18 AAPL   109.720001  110.540001  109.660004  110.059998   27404300.0
           GOOG   771.369995  775.000000  760.000000  760.539978    1526200.0
           MSFT    60.779999   61.139999   60.299999   60.349998   26580600.0
2016-11-21 AAPL   110.120003  111.989998  110.010002  111.730003   29119100.0
           GOOG   762.609985  769.700012  760.599976  769.200012    1323000.0
           MSFT    60.500000   60.970001   60.419998   60.860001   19563200.0
2016-11-22 AAPL   111.949997  112.419998  111.400002  111.800003   25922600.0
           GOOG   772.630005  776.960022  767.000000  768.270020    1591800.0
           MSFT    60.980000   61.259998   60.810001   61.119999   22645300.0
2016-11-23 AAPL   111.360001  111.510002  110.330002  111.230003   27387900.0
           GOOG   767.729980  768.283020  755.250000  760.989990    1477400.0
           MSFT    61.009998   61.099998   60.250000   60.400002   21847200.0
2016-11-25 AAPL   111.129997  111.870003  110.949997  111.790001   11424400.0
           GOOG   764.260010  765.000000  760.520020  761.679993     586000.0
           MSFT    60.299999   60.529999   60.130001   60.529999    8370500.0
2016-11-28 AAPL   111.430000  112.470001  111.389999  111.570000   27026600.0
           GOOG   760.000000  779.530029  759.799988  768.239990    2172200.0
           MSFT    60.340000   61.020000   60.209999   60.610001   20603800.0
2016-11-29 AAPL   110.779999  112.029999  110.070000  111.459999   28459300.0
           GOOG   771.530029  778.500000  768.239990  770.840027    1604500.0
           MSFT    60.650002   61.410000   60.520000   61.090000   22010800.0
2016-11-30 AAPL   111.599998  112.199997  110.269997  110.519997   35765000.0
           GOOG   770.070007  772.989990  754.830017  758.039978    2365800.0
           MSFT    60.860001   61.180000   60.220001   60.259998   33783900.0
2016-12-01 AAPL   110.370003  110.940002  109.029999  109.489998   36825800.0
           GOOG   757.440002  759.849976  737.025024  747.919983    2996900.0
           MSFT    60.110001   60.150002   58.939999   59.200001   33917000.0
2016-12-02 AAPL   109.169998  110.089996  108.849998  109.900002   26409800.0
           GOOG   744.590027  754.000000  743.099976  750.500000    1448700.0
           MSFT    59.080002   59.470001   58.799999   59.250000   25384900.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.362333
           DELL    12.149920
           GOOG   293.821674
           MSFT    25.878448
2012-05-31 AAPL    75.174961
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.746145
2012-06-01 AAPL    72.996726
           DELL    11.675920
           GOOG   285.205295
           MSFT    25.093451
2012-06-04 AAPL    73.426126
           DELL    11.608210
           GOOG   289.006480
           MSFT    25.181652
2012-06-05 AAPL    73.236155
           DELL    11.762980
           GOOG   284.920579
           MSFT    25.146372
2012-06-06 AAPL    74.359101
           DELL    11.816190
           GOOG   289.995487
           MSFT    25.887268
2012-06-07 AAPL    74.392930
           DELL    11.733960
           GOOG   288.826666
           MSFT    25.781425
2012-06-08 AAPL    75.511971
           DELL    11.724290
...                      ...
2016-11-18 AAPL   110.059998
           GOOG   760.539978
           MSFT    60.349998
2016-11-21 AAPL   111.730003
           GOOG   769.200012
           MSFT    60.860001
2016-11-22 AAPL   111.800003
           GOOG   768.270020
           MSFT    61.119999
2016-11-23 AAPL   111.230003
           GOOG   760.989990
           MSFT    60.400002
2016-11-25 AAPL   111.790001
           GOOG   761.679993
           MSFT    60.529999
2016-11-28 AAPL   111.570000
           GOOG   768.239990
           MSFT    60.610001
2016-11-29 AAPL   111.459999
           GOOG   770.840027
           MSFT    61.090000
2016-11-30 AAPL   110.519997
           GOOG   758.039978
           MSFT    60.259998
2016-12-01 AAPL   109.489998
           GOOG   747.919983
           MSFT    59.200001
2016-12-02 AAPL   109.900002
           GOOG   750.500000
           MSFT    59.250000

[3781 rows x 6 columns]

In [287]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 1150 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2016-12-02 00:00:00
Minor_axis axis: AAPL to MSFT